performance-test/minare-test.yml
config:
  target: "http://localhost:8080"
  phases:
    - duration: 10
      arrivalRate: 1
      name: "Testing basic connection"
  processor: "./minare-processor.js"
  engines:
    ws: {}

scenarios:
  - name: "Minare WebSocket Basic Test"
    engine: "ws"
    flow:
      - function: "setupVirtualUser"
      - think: 1
      - function: "connectCommandSocket"
      - think: 1
      - function: "connectUpdateSocket"
      - think: 1
      - function: "sendTestCommand"
      - think: 2